In [28]:
import pandas as pd

In [29]:
import statistics

In [30]:
height_database = pd.read_csv('Height of Male and Female by Country 2022.csv')

In [31]:
height_database.head()

,Rank,Country Name,Male Height in Cm,Female Height in Cm,Male Height in Ft,Female Height in Ft
0,1,Netherlands,183.78,170.36,6.03,5.59
1,2,Montenegro,183.30,169.96,6.01,5.58
2,3,Estonia,182.79,168.66,6.00,5.53
3,4,Bosnia and Herzegovina,182.47,167.47,5.99,5.49
4,5,Iceland,182.10,168.91,5.97,5.54

In [32]:
height_database.tail(10)

,Rank,Country Name,Male Height in Cm,Female Height in Cm,Male Height in Ft,Female Height in Ft
189,190,Madagascar,165.16,153.06,5.42,5.02
190,191,Bangladesh,165.08,152.38,5.42,5.00
191,192,Yemen,164.42,154.76,5.39,5.08
192,193,Nepal,164.36,152.39,5.39,5.00
193,194,Guatemala,164.36,150.91,5.39,4.95
194,195,Mozambique,164.30,155.42,5.39,5.10
195,196,Papua New Guinea,163.10,156.89,5.35,5.15
196,197,Solomon Islands,163.07,156.79,5.35,5.14
197,198,Laos,162.78,153.10,5.34,5.02
198,199,Timor-Leste,160.13,152.71,5.25,5.01

In [33]:
height_database[height_database['Country Name'] == 'Honduras']

,Rank,Country Name,Male Height in Cm,Female Height in Cm,Male Height in Ft,Female Height in Ft
146,147,Honduras,169.59,155.18,5.56,5.09

In [34]:
height_database[height_database['Country Name'] == 'Guatemala']

,Rank,Country Name,Male Height in Cm,Female Height in Cm,Male Height in Ft,Female Height in Ft
193,194,Guatemala,164.36,150.91,5.39,4.95

In [35]:
height_database.mode(numeric_only=True)

,Rank,Male Height in Cm,Female Height in Cm,Male Height in Ft,Female Height in Ft
0,1,170.67,154.76,5.6,5.24
1,2,NaN,155.18,NaN,5.29
2,3,NaN,156.54,NaN,NaN
3,4,NaN,156.72,NaN,NaN
4,5,NaN,156.89,NaN,NaN
...,...,...,...,...,...
194,195,NaN,NaN,NaN,NaN
195,196,NaN,NaN,NaN,NaN
196,197,NaN,NaN,NaN,NaN
197,198,NaN,NaN,NaN,NaN
198,199,NaN,NaN,NaN,NaN

In [9]:
height_database[height_database['Male Height in Cm'] == 170.67]

,Rank,Country Name,Male Height in Cm,Female Height in Cm,Male Height in Ft,Female Height in Ft
128,129,Mongolia,170.67,159.89,5.6,5.25
129,130,El Salvador,170.67,156.39,5.6,5.13
130,131,Saudi Arabia,170.67,158.84,5.6,5.21

In [10]:
print(height_database[height_database['Female Height in Cm']==154.76])
print(height_database[height_database['Female Height in Cm']==155.18])
print(height_database[height_database['Female Height in Cm']==156.54])
print(height_database[height_database['Female Height in Cm']==156.72])

     Rank      Country Name  Male Height in Cm  Female Height in Cm  \
187   188  Marshall Islands             165.26               154.76
191   192             Yemen             164.42               154.76

     Male Height in Ft  Female Height in Ft
187               5.42                 5.08
191               5.39                 5.08
     Rank Country Name  Male Height in Cm  Female Height in Cm  \
146   147     Honduras             169.59               155.18
178   179        India             166.50               155.18

     Male Height in Ft  Female Height in Ft
146               5.56                 5.09
178               5.46                 5.09
     Rank Country Name  Male Height in Cm  Female Height in Cm  \
169   170      Comoros             167.72               156.54
185   186      Liberia             165.48               156.54

     Male Height in Ft  Female Height in Ft
169               5.50                 5.14
185               5.43                 5.14
     Rank Country Name  Male Height in Cm  Female Height in Cm  \
167   168      Lesotho             167.92               156.72
182   183       Rwanda             166.02               156.72

     Male Height in Ft  Female Height in Ft
167               5.51                 5.14
182               5.45                 5.14

In [11]:
height_database.mean(numeric_only=True)

Rank                   100.000000
Male Height in Cm      173.089045
Female Height in Cm    160.942915
Male Height in Ft        5.678794
Female Height in Ft      5.280402
dtype: float64

In [36]:
height_database.median(numeric_only=True)

Rank                   100.00
Male Height in Cm      173.53
Female Height in Cm    160.62
Male Height in Ft        5.69
Female Height in Ft      5.27
dtype: float64

In [37]:
height_database[height_database['Male Height in Cm'] == 173.53]

,Rank,Country Name,Male Height in Cm,Female Height in Cm,Male Height in Ft,Female Height in Ft
99,100,Venezuela,173.53,160.04,5.69,5.25
100,101,Taiwan,173.53,160.70,5.69,5.27

In [13]:
height_database.describe

<bound method NDFrame.describe of      Rank            Country Name  Male Height in Cm  Female Height in Cm  \
0       1             Netherlands             183.78               170.36
1       2              Montenegro             183.30               169.96
2       3                 Estonia             182.79               168.66
3       4  Bosnia and Herzegovina             182.47               167.47
4       5                 Iceland             182.10               168.91
..    ...                     ...                ...                  ...
194   195              Mozambique             164.30               155.42
195   196        Papua New Guinea             163.10               156.89
196   197         Solomon Islands             163.07               156.79
197   198                    Laos             162.78               153.10
198   199             Timor-Leste             160.13               152.71

     Male Height in Ft  Female Height in Ft
0                 6.03                 5.59
1                 6.01                 5.58
2                 6.00                 5.53
3                 5.99                 5.49
4                 5.97                 5.54
..                 ...                  ...
194               5.39                 5.10
195               5.35                 5.15
196               5.35                 5.14
197               5.34                 5.02
198               5.25                 5.01

[199 rows x 6 columns]>

In [15]:
statistics.stdev(height_database['Female Height in Cm'])

4.076376702160618

In [16]:
statistics.variance(height_database['Female Height in Cm'])

16.616847017917877

In [20]:
max(height_database['Female Height in Cm'])

170.36

In [21]:
min(height_database['Female Height in Cm'])

150.91

In [23]:
rango = max(height_database['Female Height in Cm']) - min(height_database['Female Height in Cm'])
print(rango)

19.450000000000017